In [3]:
import pandas as pd

In [4]:
df =pd.read_csv('G23_Fashion â€“ Designers  Collections with Fashion Shows_merged (1).csv', sep = ',')

In [6]:
Designers_collections=df.loc[:,['designer_id', 'collection_id', 'contribution_percentage',]]

In [7]:
Designers_collections.head(3)

   designer_id  collection_id  contribution_percentage
0           46            117                    85.16
1           78             68                    28.03
2           12              8                    83.98

In [9]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Designers_collections.to_sql('Designers_collections', conexao, if_exists='replace', index=False)
conexao.close()

In [8]:
Collections.head(5)

     collection_id     style theme  season  release_year
248              1  cultural  even    Fall          2014
148              1     truth  even    Fall          2014
243              2      life    no  Summer          2012
364              2      life    no  Summer          2012
271              2      each    no  Summer          2012

In [9]:
Collections.drop_duplicates(inplace=True)

In [10]:
Collections.head(5)

     collection_id     style theme  season  release_year
248              1  cultural  even    Fall          2014
148              1     truth  even    Fall          2014
243              2      life    no  Summer          2012
271              2      each    no  Summer          2012
72               2  evidence    no  Summer          2012

In [12]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Collections.to_sql('Collections', conexao, if_exists='replace', index=False)
conexao.close()